Процедура Алгоритмы(ОбъектФормы) Экспорт
	
	ФайлОбработчика = ФайлОбработчика(ОбъектФормы.Алгоритм, СокрЛП(ОбъектФормы.Код), ОбъектФормы.ЭтоФункция, ОбъектФормы.Параметры, ОбъектФормы.Экспортный);
	ЗапуститьПриложение(ФайлОбработчика,, Истина);
	ОбъектФормы.Алгоритм = ПолучитьТекстОбработчика(ФайлОбработчика);
	
КонецПроцедуры

Функция ПолучитьТекстОбработчика(ИмяФайла)
	
	ТекстФайла = Новый ТекстовыйДокумент;     
	ТекстФайла.Прочитать(ИмяФайла);
	ТекстФайла.УдалитьСтроку(1);
	ТекстФайла.УдалитьСтроку(ТекстФайла.КоличествоСтрок());
	ТекстОбработчика = ТекстФайла.ПолучитьТекст();
	УдалитьФайлы(ИмяФайла);

	Возврат ТекстОбработчика;
	
КонецФункции


Функция ФайлОбработчика(Алгоритм, ИмяАлгоритма, ЭтоФункция, ПараметрыОбработчика, Экспортный = Ложь)
	
	ТекстФайла = Новый ТекстовыйДокумент;     
	ТекстФайла.УстановитьТипФайла(КодировкаТекста.UTF8);
	
	ТекстФайла.ДобавитьСтроку(?(ЭтоФункция, "Функция ", "Процедура ") + ИмяАлгоритма + "(" + ПараметрыОбработчика + ")" + ?(Экспортный, " Экспорт", ""));
	ТекстФайла.ДобавитьСтроку(Алгоритм);
	ТекстФайла.ДобавитьСтроку(?(ЭтоФункция, "КонецФункции", "КонецПроцедуры"));
	
	ИмяФайла = ПолучитьИмяВременногоФайла("bsl");
	ТекстФайла.Записать(ИмяФайла);
	
	Возврат ИмяФайла;
	
КонецФункции



Функция ПараметрыОбработчика_Алгоритмы()
	
	Возврат "";
	
КонецФункции
