
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Конвертация") Тогда
		Объект.Конвертация = Параметры.Конвертация;
		
		Настройки = Обработки.vsc_НастройкаПравилСозданияМенеджераОбмена.ПрочитатьНастройки(Объект.Конвертация);
		
		Объект.КаталогДляГотовыхФайлов        = Настройки.КаталогДляГотовыхФайлов;
		Объект.ВерсияПлатформыДляГенерацииEPF = Настройки.ВерсияПлатформыДляГенерацииEPF;
		Объект.РежимОтладки                   = Настройки.РежимОтладки;
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КаталогДляГотовыхФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыбратьФайлДляЗагрузки("КаталогДляГотовыхФайлов");
КонецПроцедуры

&НаКлиенте
Процедура ВерсияПлатформыДляГенерацииEPFНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыбратьФайлДляЗагрузки("ВерсияПлатформыДляГенерацииEPF");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы


&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиНаСервере()
	Обработки.vsc_НастройкаПравилСозданияМенеджераОбмена.ЗаписатьНастройки(Объект.Конвертация,Объект.КаталогДляГотовыхФайлов,Объект.ВерсияПлатформыДляГенерацииEPF,Объект.РежимОтладки);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНастройки(Команда)
	ЗаписатьНастройкиНаСервере();
	ЭтаФорма.Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбратьФайлДляЗагрузки(Знач ИмяКаталога)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок      = "Выберите каталог";
	
	Диалог.Каталог = Объект[ИмяКаталога];
	
	Диалог.МножественныйВыбор = Ложь;
	Если Диалог.Выбрать() Тогда
		Объект[ИмяКаталога] = Диалог.Каталог;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти