
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Конвертация") Тогда
		Объект.Конвертация = Параметры.Конвертация;
		
		Настройки = Обработки.vsc_НастройкаПравилСозданияМенеджераОбмена.ПрочитатьНастройки(Объект.Конвертация);
		
		Объект.КаталогДляГотовыхФайлов        = Настройки.КаталогДляГотовыхФайлов;
		Объект.ВерсияПлатформыДляГенерацииEPF = Настройки.ВерсияПлатформыДляГенерацииEPF;
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
//Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы


&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиНаСервере()
	Обработки.vsc_НастройкаПравилСозданияМенеджераОбмена.ЗаписатьНастройки(Объект.Конвертация,Объект.КаталогДляГотовыхФайлов,Объект.ВерсияПлатформыДляГенерацииEPF);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНастройки(Команда)
	ЗаписатьНастройкиНаСервере();
	ЭтаФорма.Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//Код процедур и функций
#КонецОбласти