
Процедура ЗаписатьНастройки(Знач Конвертация, КаталогДляГотовыхФайлов, ВерсияПлатформыДляГенерацииEPF) Экспорт
	
	КлючОбъектаМенеджераНастроек = КлючОбъектаМенеджераНастроек(Конвертация);
	ХранилищеОбщихНастроек.Сохранить(КлючОбъектаМенеджераНастроек, "КаталогДляГотовыхФайлов", 		КаталогДляГотовыхФайлов);
	ХранилищеОбщихНастроек.Сохранить(КлючОбъектаМенеджераНастроек, "ВерсияПлатформыДляГенерацииEPF", 	ВерсияПлатформыДляГенерацииEPF);
	
КонецПроцедуры

Функция КлючОбъектаМенеджераНастроек(Знач КлючОбъекта)
	
	ОписаниеТиповСтрока 		= Новый ОписаниеТипов("Строка");
	
	УникальныйИдентификаторОбъекта = ОписаниеТиповСтрока.ПривестиЗначение(КлючОбъекта.УникальныйИдентификатор());
	
	Возврат "Справочники.Конвертации{" + УникальныйИдентификаторОбъекта + "}";
	
КонецФункции


Функция ПрочитатьНастройки(Знач Конвертация) Экспорт
	
	КлючОбъектаМенеджераНастроек = КлючОбъектаМенеджераНастроек(Конвертация);
	
	КаталогДляГотовыхФайлов 		= ХранилищеОбщихНастроек.Загрузить(КлючОбъектаМенеджераНастроек, "КаталогДляГотовыхФайлов"); 	
	ВерсияПлатформыДляГенерацииEPF 	= ХранилищеОбщихНастроек.Загрузить(КлючОбъектаМенеджераНастроек, "ВерсияПлатформыДляГенерацииEPF"); 	
	
	Настройки = Новый Структура;
	Настройки.Вставить("КаталогДляГотовыхФайлов",			КаталогДляГотовыхФайлов);
	Настройки.Вставить("ВерсияПлатформыДляГенерацииEPF",	ВерсияПлатформыДляГенерацииEPF);
	
	Возврат Настройки;
	
КонецФункции
