
Процедура ЗаписатьНастройки(Знач Конвертация, КаталогДляГотовыхФайлов, ВерсияПлатформыДляГенерацииEPF, РежимОтладки = Ложь) Экспорт
	
	КлючОбъектаМенеджераНастроек = КлючОбъектаМенеджераНастроек(Конвертация);
	ХранилищеОбщихНастроек.Сохранить(КлючОбъектаМенеджераНастроек, "КаталогДляГотовыхФайлов", 			КаталогДляГотовыхФайлов);
	ХранилищеОбщихНастроек.Сохранить(КлючОбъектаМенеджераНастроек, "ВерсияПлатформыДляГенерацииEPF", 	ВерсияПлатформыДляГенерацииEPF);
	ХранилищеОбщихНастроек.Сохранить(КлючОбъектаМенеджераНастроек, "РежимОтладки", 						РежимОтладки);
	
КонецПроцедуры

Функция КлючОбъектаМенеджераНастроек(Знач КлючОбъекта)
	
	ОписаниеТиповСтрока 		= Новый ОписаниеТипов("Строка");
	
	УникальныйИдентификаторОбъекта = ОписаниеТиповСтрока.ПривестиЗначение(КлючОбъекта.УникальныйИдентификатор());
	
	Возврат "Справочники.Конвертации{" + УникальныйИдентификаторОбъекта + "}";
	
КонецФункции


Функция ПрочитатьНастройки(Знач Конвертация) Экспорт
	
	КлючОбъектаМенеджераНастроек = КлючОбъектаМенеджераНастроек(Конвертация);
	
	КаталогДляГотовыхФайлов 		= ХранилищеОбщихНастроек.Загрузить(КлючОбъектаМенеджераНастроек, "КаталогДляГотовыхФайлов"); 	
	ВерсияПлатформыДляГенерацииEPF 	= ХранилищеОбщихНастроек.Загрузить(КлючОбъектаМенеджераНастроек, "ВерсияПлатформыДляГенерацииEPF"); 	
	РежимОтладки 					= ХранилищеОбщихНастроек.Загрузить(КлючОбъектаМенеджераНастроек, "РежимОтладки"); 	
	
	Настройки = Новый Структура;
	Настройки.Вставить("КаталогДляГотовыхФайлов",			?(КаталогДляГотовыхФайлов = Неопределено, 			"", 	КаталогДляГотовыхФайлов));
	Настройки.Вставить("ВерсияПлатформыДляГенерацииEPF",	?(ВерсияПлатформыДляГенерацииEPF = Неопределено, 	"", 	ВерсияПлатформыДляГенерацииEPF));
	Настройки.Вставить("РежимОтладки",						?(РежимОтладки = Неопределено, 						Ложь, 	РежимОтладки));
	
	Возврат Настройки;
	
КонецФункции
