
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	ОбъектФормы = ПараметрыВыполненияКоманды.Источник.Объект;
	
	ТипПараметра = ТипЗнч(ПараметрКоманды);
	
	Если ТипПараметра = Тип("СправочникСсылка.Алгоритмы") Тогда
		
		vsc_ОбработчикиРедактирования.Алгоритмы(ОбъектФормы);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Обработчик не описан.");
		
	КонецЕсли;
	
	
КонецПроцедуры


